Revit 2024 API
SchemaException Class
The exception thrown when Revit cannot interpret a data structure described by a schema.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
[SerializableAttribute]
public class SchemaException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class SchemaException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class SchemaException : public InvalidOperationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.SchemaException
See Also
SchemaException Members
Autodesk.Revit.Exceptions Namespace